Тестовая_база_ERP_14/src/InformationRegisters/ДолиСписанияКосвенныхРасходов/ДолиСписанияКосвенныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолиСписанияКосвенныхРасходов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДоляРасходовНаРекламу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляПредставительскихРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляРасходовНаДобровольноеМедицинскоеСтрахование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляРасходовНаДобровольноеСтрахованиеЖизни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляРасходовНаДобровольноеСтрахованиеОтНесчастныхСлучаев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляРасходовНаВозмещениеПроцентовРаботникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляТранспортныхРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляРезервовПоСомнительнымДолгамНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/ДолиСписанияКосвенныхРасходов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает соответствие имен ресурсов регистра видам нормируемых расходов.
//
// Возвращаемое значение:
// 	ВидыРасходов - Соотвествие - Результат
// 						* Ключ - Имя ресурса регистра.
// 						* Значение - Имя вида нормируемого расхода.
//
Функция ИменаВидовНормируемыхРасходов() Экспорт
	
	ВидыРасходов = Новый Соответствие; 
	ВидыРасходов.Вставить(
		"ДоляРасходовНаРекламу",
		"РасходыНаРекламуНормируемые");
	ВидыРасходов.Вставить(
		"ДоляПредставительскихРасходов",
		"ПредставительскиеРасходы");
	ВидыРасходов.Вставить(
		"ДоляРасходовНаДобровольноеМедицинскоеСтрахование",
		"ДобровольноеЛичноеСтрахование");
	ВидыРасходов.Вставить(
		"ДоляРасходовНаДобровольноеСтрахованиеЖизни",
		"ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников");
	ВидыРасходов.Вставить(
		"ДоляРасходовНаДобровольноеСтрахованиеОтНесчастныхСлучаев",
		"ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности");
	ВидыРасходов.Вставить(
		"ДоляРасходовНаВозмещениеПроцентовРаботникам",
		"РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов");
		
	Возврат ВидыРасходов;
		
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
